    city_map = {
        "منطقة صباح السالم": {
            "صباح السالم","العدان","المسيلة","أبو فطيرة","أبو الحصانية",
            "مبارك الكبير","القصور","القرين","الفنيطيس","المسايل"
        },

        "منطقة المهبولة": {
            "الفنطاس","المهبولة"
        },

        "منطقة الفحيحيل": {
            "الفحيحيل الصناعية","أبو حليفة","المنقف","الفحيحيل"
        },

        "منطقة جابر الاحمد": {
            "مدينة جابر الأحمد","شمال غرب الصليبيخات","الرحاب","صباح الناصر",
            "الفردوس","الأندلس","النهضة","غرناطة","الدوحة",
            "جنوب الدوحة / القيروان","القيروان"
        },

        "منطقة العارضية": {
            "العارضية حرفية","العارضية","العارضية المنطقة الصناعية",
            "الصليبخات","الري","اشبيلية","الرقعي"
        },

        "منطقة سلوي": {
            "مبارك العبدالله غرب مشرف","سلوى","بيان","الرميثية","مشرف"
        },

        "منطقة السالمية": {
            "السالمية","ميدان حولي","البدع"
        },

        "منطقة الجهراء": {
            "الجهراء","الصلبية الصناعية","الصليبية الصناعية","مزارع الصليبية",
            "الصليبية السكنية","مدينة سعد العبد الله","الصليبية","أمغرة",
            "سكراب امغرة","جنوب امغرة","القصر","النعيم","معسكرات الجهراء",
            "تيماء","النسيم","الجهراء المنطقة الصناعية","جواخير الجهراء",
            "العيون","الواحة","اسطبلات الجهراء","مزارع الطليبية"
        },

        "منطقة خيطان": {
            "خيطان"
        },

        "منطقة الفروانية": {
            "الفروانية"
        },

        "منطقه الصباحية": {
            "اسواق القرين","الظهر","جابر العلي","العقيلة","الرقة","المقوع",
            "فهد الأحمد","الصباحية","هدية","الجليعه","علي صباح السالم"
        },

        "منطقة صباح الاحمد": {
            "صباح الأحمد3","الجليعة","صباح الأحمد","مدينة صباح الأحمد",
            "ميناء عبد الله","بنيدر","الوفرة","الخيران","الزور","النويصب",
            "شمال الأحمدي","جنوب الأحمدي","شرق الأحمدي","وسط الأحمدي",
            "الأحمدي","غرب الأحمدي","ام الهيمان","الشعيبة"
        },

        "منطقة حولي": {
            "حولي"
        },

        "منطقة الجابرية": {
            "الجابرية","قرطبة","اليرموك","السرة"
        },

        "منطقة العاصمة": {
            "حدائق السور","دسمان","القبلة","المرقاب","مدينة الكويت","المباركية","شرق‎"
        },

        "منطقة الشويخ": {
            "الشويخ الصناعية","الشويخ","الشويخ السكنية","ميناء الشويخ"
        },

        "منطقة الشعب": {
            "ضاحية عبد الله السالم","الدعية","القادسية","النزهة","الفيحاء",
            "كيفان","الشعب","الروضة","الخالدية","العديلية","الدسمة",
            "الشامية","المنصورية","بنيد القار"
        },

        "منطقة عبدالله المبارك": {
            "السلام","الشدادية","غرب عبدالله المبارك","عبدالله المبارك",
            "العمرية","منطقة المطار","حطين","الشهداء","صبحان","الزهراء",
            "الصديق","الرابية","كبد","الرحاب","الضجيج","الافينيوز",
            "جنوب السرة","عبدالله مبارك الصباح"
        },

        "جليب الشيوخ": {
            "جليب الشيوخ","العباسية","شارع محمد بن القاسم","الحساوي"
        },

        "المطلاع": {
            "المطلاع","العبدلي","السكراب"
        }
    }

    for area, cities in city_map.items():
        if city in cities:
            return area

    return "Other City"
